Revit 2027 API
IdlingEventArgs Methods
The IdlingEventArgs type exposes the following members.
Methods
Name | Description
Cancel |  When the event is cancellable, may call the Cancel() method to cancel it.
(Inherited from RevitAPIPreEventArgs)
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
SetRaiseWithoutDelay |  Sets the next invocation of the idling event to be called promptly, rather than relying on the default recurrence of idling from the Revit application. For more details see the remarks describing the Idling event.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
IdlingEventArgs Class
Autodesk.Revit.UI.Events Namespace